Merge remote-tracking branch 'upstream/main'
# Conflicts:
#	docs/gateway/index.md
